Tekla Open API Reference for Tekla Structures 2025
LeaderLinePlacing Properties
The LeaderLinePlacing type exposes the following members.
Properties
Name | Description
StartPoint
 The start point of the leader line (if multiple leader lines exist, only returns the first).
Top
See Also
Reference
LeaderLinePlacing Class
Tekla.Structures.Drawing Namespace